class_name: Sequential
config:
- class_name: ZeroPadding2D
  config:
    batch_input_shape: !!python/tuple [null, 3, 448, 448]
    input_dtype: float32
    name: zeropadding2d_1
    padding: !!python/tuple [1, 1]
    trainable: true
- class_name: Convolution2D
  config:
    W_constraint: null
    W_regularizer: null
    activation: linear
    activity_regularizer: null
    b_constraint: null
    b_regularizer: null
    bias: true
    border_mode: valid
    dim_ordering: th
    init: glorot_uniform
    name: convolution2d_1
    nb_col: 3
    nb_filter: 16
    nb_row: 3
    subsample: !!python/tuple [1, 1]
    trainable: true
- class_name: LeakyReLU
  config: {alpha: 0.1, name: leakyrelu_1, trainable: true}
- class_name: MaxPooling2D
  config:
    border_mode: valid
    dim_ordering: th
    name: maxpooling2d_1
    pool_size: &id001 !!python/tuple [2, 2]
    strides: *id001
    trainable: true
- class_name: ZeroPadding2D
  config:
    name: zeropadding2d_2
    padding: !!python/tuple [1, 1]
    trainable: true
- class_name: Convolution2D
  config:
    W_constraint: null
    W_regularizer: null
    activation: linear
    activity_regularizer: null
    b_constraint: null
    b_regularizer: null
    bias: true
    border_mode: valid
    dim_ordering: th
    init: glorot_uniform
    name: convolution2d_2
    nb_col: 3
    nb_filter: 32
    nb_row: 3
    subsample: &id003 !!python/tuple [1, 1]
    trainable: true
- class_name: LeakyReLU
  config: {alpha: 0.1, name: leakyrelu_2, trainable: true}
- class_name: MaxPooling2D
  config:
    border_mode: valid
    dim_ordering: th
    name: maxpooling2d_2
    pool_size: &id002 !!python/tuple [2, 2]
    strides: *id002
    trainable: true
- class_name: ZeroPadding2D
  config:
    name: zeropadding2d_3
    padding: !!python/tuple [1, 1]
    trainable: true
- class_name: Convolution2D
  config:
    W_constraint: null
    W_regularizer: null
    activation: linear
    activity_regularizer: null
    b_constraint: null
    b_regularizer: null
    bias: true
    border_mode: valid
    dim_ordering: th
    init: glorot_uniform
    name: convolution2d_3
    nb_col: 3
    nb_filter: 64
    nb_row: 3
    subsample: *id003
    trainable: true
- class_name: LeakyReLU
  config: {alpha: 0.1, name: leakyrelu_3, trainable: true}
- class_name: MaxPooling2D
  config:
    border_mode: valid
    dim_ordering: th
    name: maxpooling2d_3
    pool_size: *id002
    strides: *id002
    trainable: true
- class_name: ZeroPadding2D
  config:
    name: zeropadding2d_4
    padding: !!python/tuple [1, 1]
    trainable: true
- class_name: Convolution2D
  config:
    W_constraint: null
    W_regularizer: null
    activation: linear
    activity_regularizer: null
    b_constraint: null
    b_regularizer: null
    bias: true
    border_mode: valid
    dim_ordering: th
    init: glorot_uniform
    name: convolution2d_4
    nb_col: 3
    nb_filter: 128
    nb_row: 3
    subsample: *id003
    trainable: true
- class_name: LeakyReLU
  config: {alpha: 0.1, name: leakyrelu_4, trainable: true}
- class_name: MaxPooling2D
  config:
    border_mode: valid
    dim_ordering: th
    name: maxpooling2d_4
    pool_size: *id002
    strides: *id002
    trainable: true
- class_name: ZeroPadding2D
  config:
    name: zeropadding2d_5
    padding: !!python/tuple [1, 1]
    trainable: true
- class_name: Convolution2D
  config:
    W_constraint: null
    W_regularizer: null
    activation: linear
    activity_regularizer: null
    b_constraint: null
    b_regularizer: null
    bias: true
    border_mode: valid
    dim_ordering: th
    init: glorot_uniform
    name: convolution2d_5
    nb_col: 3
    nb_filter: 256
    nb_row: 3
    subsample: *id003
    trainable: true
- class_name: LeakyReLU
  config: {alpha: 0.1, name: leakyrelu_5, trainable: true}
- class_name: MaxPooling2D
  config:
    border_mode: valid
    dim_ordering: th
    name: maxpooling2d_5
    pool_size: *id002
    strides: *id002
    trainable: true
- class_name: ZeroPadding2D
  config:
    name: zeropadding2d_6
    padding: !!python/tuple [1, 1]
    trainable: true
- class_name: Convolution2D
  config:
    W_constraint: null
    W_regularizer: null
    activation: linear
    activity_regularizer: null
    b_constraint: null
    b_regularizer: null
    bias: true
    border_mode: valid
    dim_ordering: th
    init: glorot_uniform
    name: convolution2d_6
    nb_col: 3
    nb_filter: 512
    nb_row: 3
    subsample: *id003
    trainable: true
- class_name: LeakyReLU
  config: {alpha: 0.1, name: leakyrelu_6, trainable: true}
- class_name: MaxPooling2D
  config:
    border_mode: valid
    dim_ordering: th
    name: maxpooling2d_6
    pool_size: *id002
    strides: *id002
    trainable: true
- class_name: ZeroPadding2D
  config:
    name: zeropadding2d_7
    padding: !!python/tuple [1, 1]
    trainable: true
- class_name: Convolution2D
  config:
    W_constraint: null
    W_regularizer: null
    activation: linear
    activity_regularizer: null
    b_constraint: null
    b_regularizer: null
    bias: true
    border_mode: valid
    dim_ordering: th
    init: glorot_uniform
    name: convolution2d_7
    nb_col: 3
    nb_filter: 1024
    nb_row: 3
    subsample: *id003
    trainable: true
- class_name: LeakyReLU
  config: {alpha: 0.1, name: leakyrelu_7, trainable: true}
- class_name: ZeroPadding2D
  config:
    name: zeropadding2d_8
    padding: !!python/tuple [1, 1]
    trainable: true
- class_name: Convolution2D
  config:
    W_constraint: null
    W_regularizer: null
    activation: linear
    activity_regularizer: null
    b_constraint: null
    b_regularizer: null
    bias: true
    border_mode: valid
    dim_ordering: th
    init: glorot_uniform
    name: convolution2d_8
    nb_col: 3
    nb_filter: 1024
    nb_row: 3
    subsample: *id003
    trainable: true
- class_name: LeakyReLU
  config: {alpha: 0.1, name: leakyrelu_8, trainable: true}
- class_name: ZeroPadding2D
  config:
    name: zeropadding2d_9
    padding: !!python/tuple [1, 1]
    trainable: true
- class_name: Convolution2D
  config:
    W_constraint: null
    W_regularizer: null
    activation: linear
    activity_regularizer: null
    b_constraint: null
    b_regularizer: null
    bias: true
    border_mode: valid
    dim_ordering: th
    init: glorot_uniform
    name: convolution2d_9
    nb_col: 3
    nb_filter: 1024
    nb_row: 3
    subsample: *id003
    trainable: true
- class_name: LeakyReLU
  config: {alpha: 0.1, name: leakyrelu_9, trainable: true}
- class_name: Flatten
  config: {name: flatten_1, trainable: true}
- class_name: Dense
  config: {W_constraint: null, W_regularizer: null, activation: linear, activity_regularizer: null,
    b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform, input_dim: null,
    name: dense_1, output_dim: 256, trainable: true}
- class_name: Dense
  config: {W_constraint: null, W_regularizer: null, activation: linear, activity_regularizer: null,
    b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform, input_dim: null,
    name: dense_2, output_dim: 4096, trainable: true}
- class_name: LeakyReLU
  config: {alpha: 0.1, name: leakyrelu_10, trainable: true}
- class_name: Dense
  config: {W_constraint: null, W_regularizer: null, activation: linear, activity_regularizer: null,
    b_constraint: null, b_regularizer: null, bias: true, init: glorot_uniform, input_dim: null,
    name: dense_3, output_dim: 1470, trainable: true}
keras_version: 1.0.7
